In [1]:
import pandas as pd

# Question no.1

In [5]:
data = pd.Series([4,8,15,16,23,42])

In [6]:
data

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Question no.2

In [14]:
l2 = pd.Series([1,2,3,4,5,6,7,8,9,10])
l2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Question no.3

In [15]:
 data1 = ({'Name':['Alice','Bob','Claire'],
           'Age':['25','30','27'],
           'Gender':['Female','Male','Female']
           
 })

In [16]:
pd.DataFrame(data1)

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

# Question no.4

In [ ]:
 Pandas DataFrame is a 2 dimensional data structure,
like a 2 dimensional array, or a table with rows and columns.

                                                       where pandas series is a one-dimensional array holding data of any type.

In [17]:
data = pd.Series([4,8,15,16,23,42])   # pandas series

In [18]:
data

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [21]:
 data1 = ({'Name':['Alice','Bob','Claire'],
           'Age':['25','30','27'],
           'Gender':['Female','Male','Female']     # pandas Dataframe
           
          })
    
    
pd.DataFrame(data1)

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

# Question no.5

In [ ]:
There are some common functions you can use to manipulate data in a Pandas DataFrame.
head(),drop(),set_index(),dropn(),fillna(),etc...

In [22]:
import pandas as pd

In [23]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [24]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Question no.6

In [ ]:
DataFrame is mutable in nature

# Question no.7

In [32]:
import pandas as pd

In [33]:
s1 = pd.Series([2,3])

In [34]:
s2 = pd.Series([4,5])

In [ ]:
pd